Revit 2027 API
STLExportOptions(ExportResolution) Constructor
 Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public STLExportOptions(
	ExportResolution resolutionType
)
Public Sub New (
	resolutionType As ExportResolution
)
public:
STLExportOptions(
	ExportResolution resolutionType
)
new :
        resolutionType : ExportResolution -> STLExportOptions
Parameters
resolutionType ExportResolution
 The type of export resolution.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
STLExportOptions Class
STLExportOptions Overload
Autodesk.Revit.DB Namespace